/**
 * Даны две строки.
 * Выделить из каждой строки наибольшей длины подстроки,
 * состоящие только из цифр, и объедините эти подстроки в одну новую строку.
 */

import java.util.Scanner;


public class Task66 {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);

        System.out.println("Enter first string");
        String s1 = in.nextLine().toLowerCase();
        System.out.println("Enter second string");
        String s2 = in.nextLine().toLowerCase();


    }
}
